{"id":1, "data":["What is Juan Lopez Rubio's current position?", "Juan Lopez Rubio is a Full-time Assistant Professor at Universitat Politècnica de Catalunya."]}
{"id":2, "data":["Can you tell me about Juan Lopez Rubio's professional background?", "Juan Lopez Rubio is an Experienced Assistant Professor with expertise in Computer Science, embedded software, Java, .NET Framework, and MEAN stack. He holds a Ph.D. in Computer Architecture from Universitat Politècnica de Catalunya.",""]}
{"id":3, "data":["Tell me about Juan Lopez Rubio's work experience at Alteraid.", "Juan Lopez Rubio is a Co-founder of Alteraid and has been self-employed there since March 2011.",""]}
{"id":4, "data":["What was Juan Lopez Rubio's role at NASA Goddard Space Flight Center?", "Juan Lopez Rubio worked as a Research Visitor at NASA Goddard Space Flight Center from March 2013 to October 2013.",""]}
{"id":5, "data":["What is Juan Lopez Rubio's educational background?", "Juan Lopez Rubio completed his Doctor of Philosophy (Ph.D.) in Computer Architecture from Universitat Politècnica de Catalunya in the year 2011.",""]}
{"id":6, "data":["Tell me about Juan Lopez Rubio's involvement with aUPaEU.", "Juan Lopez Rubio is the coordinator of aUPaEU WP5. He is also a member of the aUPaEU General Assembly (GA) and the aUPaEU WP Leaders Board (WPLB).",""]}
{"id":7, "data":["Where did Juan Lopez Rubio pursue his Master of Science (MSc) in Computer Science?", "Juan Lopez Rubio obtained his Master of Science (MSc) in Computer Science from Universitat Politècnica de Catalunya between 1997 and 2002.",""]}
{"id":8, "data":["What was Juan Lopez Rubio's role at DoubleYou?", "Juan Lopez Rubio served as the IT Manager at DoubleYou from December 2000 to August 2002.",""]}
{"id":9, "data":["Tell me about Juan Lopez Rubio's role at i2CAT Foundation.", "Juan Lopez Rubio worked as a Technical Project Manager at i2CAT Foundation from 2006 to May 2012, contributing for 6 years and 5 months.",""]}
{"id":10, "data":["Can you provide details about Juan Lopez Rubio's role at WorldNet Consulting?", "Juan Lopez Rubio served as an IT Analyst Programmer and Server Administrator at WorldNet Consulting from September 1999 to December 2001 for 2 years and 4 months.",""]}
{"id":11, "data":["What was Juan Lopez Rubio's position at ENAC - Ecole Nationale de l'Aviation Civile?", "Juan Lopez Rubio had an undergraduate stage in Unmanned Aircraft Avionics at ENAC - Ecole Nationale de l'Aviation Civile in 2009.",""]}
{"id":12, "data":["Tell me about Juan Lopez Rubio's involvement with research at Universitat Politècnica de Catalunya.", "Juan Lopez Rubio worked as a Research Scholar at Universitat Politècnica de Catalunya in the Computer Architecture Department from 2001 to 2002, and later in the Terrain Engineering Department from 1998 to 2000.",""]}
{"id":13, "data":["What are Juan Lopez Rubio's skills?", "Juan Lopez Rubio is skilled in Computer Science, embedded software, Java, .NET Framework, and MEAN stack.",""]}
{"id":14, "data":["Where is Juan Lopez Rubio currently located?", "Juan Lopez Rubio is located in Castelldefels, Catalonia, Spain.",""]}
{"id":15, "data":["Can you provide information about Juan Lopez Rubio's Master's degree?", "Juan Lopez Rubio earned his Master of Science (MSc) in Computer Science from Universitat Politècnica de Catalunya between 1997 and 2002.",""]}
{"id":16, "data":["Tell me about Juan Lopez Rubio's undergraduate stage at USI Università della Svizzera italiana.", "Juan Lopez Rubio had an undergraduate stage at the Advanced Learning and Research Institute (ALaRI), specializing in Embedded Systems Design in 2004.",""]}
{"id":17, "data":["What is Juan Lopez Rubio's role within aUPaEU?", "Juan Lopez Rubio is the coordinator of aUPaEU WP5 (Work Package 5), demonstrating his leadership in this aspect of the project.",""]}
{"id":18, "data":["Tell me about Juan Lopez Rubio's participation in aUPaEU General Assembly.", "Juan Lopez Rubio is a member of the aUPaEU General Assembly (GA), showcasing his involvement in the overall decision-making and governance of the project.",""]}
{"id":19, "data":["What is Juan Lopez Rubio's role in aUPaEU WP Leaders Board?", "Juan Lopez Rubio holds a position in the aUPaEU WP Leaders Board (WPLB), indicating his role in guiding and coordinating the activities of the various work packages within the project.",""]}
{"id":20, "data":["How long has Juan Lopez Rubio been associated with aUPaEU?", "Juan Lopez Rubio's association with aUPaEU is characterized by his role as the coordinator of aUPaEU WP5 and as a member of both the aUPaEU General Assembly (GA) and the aUPaEU WP Leaders Board (WPLB).",""]}
{"id":21, "data":["Can you elaborate on Juan Lopez Rubio's responsibilities as aUPaEU WP5 coordinator?", "As the coordinator of aUPaEU WP5, Juan Lopez Rubio is responsible for overseeing and managing the activities and progress of Work Package 5 within the aUPaEU project.",""]}
{"id":22, "data":["Tell me more about aUPaEU WP Leaders Board.", "The aUPaEU WP Leaders Board (WPLB) is a group within the project that includes Juan Lopez Rubio, where leaders from different work packages collaborate to ensure effective coordination and alignment of efforts.",""]}
{"id":23, "data":["Tell me about Jesus Alcober's current role at aUPaEU.", "Jesus Alcober is currently serving as the coordinator of aUPaEU and is also a member of the aUPaEU General Assembly.",""]}
{"id":24, "data":["What are Jesus Alcober's responsibilities as the Coordinator of aUPaEU?", "As the coordinator of aUPaEU, Jesus Alcober is responsible for overseeing and managing the overall activities and progress of the aUPaEU project.",""]}
{"id":25, "data":["Can you provide details about Jesus Alcober's role as aUPaEU WP1 Coordinator?", "Jesus Alcober is the coordinator of aUPaEU Work Package 1 (WP1), indicating his leadership in this specific aspect of the project.",""]}
{"id":26, "data":["Tell me more about aUPaEU WP Leaders Board.", "The aUPaEU WP Leaders Board (WPLB) includes Jesus Alcober as a coordinator, where leaders from different work packages collaborate to ensure effective coordination and alignment of efforts within the aUPaEU project.",""]}
{"id":27, "data":["What is the Ignite Program at the University of Cambridge, and how is Jesus Alcober involved?", "In 2011, Jesus Alcober participated in the Ignite Program at the University of Cambridge's Judge Business School. The Ignite Program is associated with the Centre for Entrepreneurial Learning at Judge Business School, where participants engage in activities related to entrepreneurship.",""]}
{"id":28, "data":["Tell me about Jesus Alcober's role as President of the Spanish Committee CTN71 JTC1 SC6 at ISO.", "As the President of the Spanish Committee CTN71 JTC1 SC6 at ISO, Jesus Alcober is actively involved in contributing to the development of Future Network standards and shaping the future of telecommunications and information exchange between systems.",""]}
{"id":29, "data":["What is Jesus Alcober's role at the Institute of Educational Sciences (ICE)?", "From September 2020 to February 2022, Jesus Alcober served as the Deputy Director at the Institute of Educational Sciences (ICE), contributing to the advancement of teaching quality and fostering innovation in instructional activities.",""]}
{"id":30, "data":["Tell me about Jesus Alcober's role as Audiovisual Unit Director at i2CAT Foundation.", "From September 2010 to July 2012, Jesus Alcober served as the Audiovisual Unit Director at i2CAT Foundation, playing a key role in driving innovation and spearheading transformative initiatives in the audiovisual domain.",""]}
{"id":31, "data":["What was Jesus Alcober's role as the mediaCAT Manager at i2CAT Foundation?", "As the mediaCAT Manager at i2CAT Foundation from March 2002 to August 2010, Jesus Alcober played a pivotal role in the growth and development of the organization, overseeing the operations of the mediaCAT infrastructure platform and securing significant funding for UPC.",""]}
{"id":32, "data":["Tell me about Jesus Alcober's role as Associate Professor at UPC.", "As an Associate Professor at UPC, Jesus Alcober specializes in the ICT field, Networking Engineering, and Entrepreneurship. He is passionate about driving innovation in learning practices and has made significant contributions to the Master of Science on Telecommunication Engineering & Management (MASTEAM) and the Bachelor of Science on Telecommunication Engineering (Telematics) at the Castelldefels School of Telecommunications and Aerospace Engineering (EETAC).",""]}
{"id":33, "data":["What are Jesus Alcober's areas of focus as the Delegate of the Rector for the Unite! Digital Campus?", "As the Delegate of the Rector for the Unite! Digital Campus at UPC, Jesus Alcober plays a pivotal role in driving forward a transformative vision for a European virtual and physical inter-university campus, with a focus on technology and engineering excellence.",""]}
{"id":34, "data":["Tell me about Jesus Alcober's role as a Visiting Scholar at the University of Greenwich.", "As a Visiting Scholar at the University of Greenwich from September 2010 to September 2011, Jesus Alcober immersed himself in a vibrant academic environment, collaborating with British experts in the field of Future Network standards and contributing to the advancement of telecommunications and information exchange between systems.",""]}
{"id":35, "data":["Can you provide information about Jesus Alcober's educational background?", "Jesus Alcober earned a Ph.D. in Telecommunications from Universitat Politècnica de Catalunya in 1997 and a Master of Science (Master Sc) in Telecommunications from the same institution in 1993."]}
{"id":36, "data":["Tell me about Jesus Alcober's role as Co-Founder of Alteraid.", "As the Co-Founder of Alteraid SL since March 2011, Jesus Alcober is passionate about leveraging ICT technologies to enhance people's quality of life. Alteraid focuses on creating and developing products and services that provide personalized management support and facilitate the processing of information associated with oneself and close individuals.",""]}
{"id":37, "data":["What is Jesus Alcober's role as a member of FOR EU IT Board?", "Jesus Alcober is a member of FOR EU IT Board, showcasing his involvement in this board related to IT matters in the context of the European Union.",""]}
{"id":38, "data":["Tell me about Alba Roma Gómez's educational background.", "Alba Roma Gómez is studying a double degree in Aerospace Engineering and Telecommunications (Network) Engineering at UPC University and is currently in her 5th year of studies.",""]}
{"id":39, "data":["What is Alba Roma Gómez's experience at the Universitat Politècnica de Catalunya?", "Alba Roma Gómez is currently undertaking a research internship at the Universitat Politècnica de Catalunya, focusing on Odoo, Drones, and another skill. She has been involved in this internship since March 2023.",""]}
{"id":40, "data":["Can you provide details about Alba Roma Gómez's role as Project Lead at Bridge to Belong?", "Alba Roma Gómez served as a Project Lead at Bridge to Belong from March 2023 to January 2024, working on React Native and React technologies.",""]}
{"id":41, "data":["Tell me about Alba Roma Gómez's experience as a Backend Intern at Innovamat.", "Alba Roma Gómez worked as a Backend Intern at Innovamat for three months, from July 2022 to September 2022, gaining experience in Test Driven Development, PHP, and another skill.",""]}
{"id":42, "data":["What was Alba Roma Gómez's role during her internship at Plasticband?", "During her full-time internship at Plasticband in July 2020, Alba Roma Gómez was involved in the assembly of a Lean Manufacturing cell for the production of a strapping machine and the design of a manufacturing table using Solidworks.",""]}
{"id":43, "data":["Tell me about Alba Roma Gómez's bachelor's degree at Universitat Politècnica de Catalunya.", "Alba Roma Gómez obtained a Bachelor's Degree in Aerospace Systems Engineering (major in Air Navigation) and a Bachelor's Degree in Network Engineering (Computer Systems Networking and Telecommunications) from EETAC - UPC, with skills in Python, Aerodynamics, SOLIDWORKS, Simulink, C#, HTML, Java, React Native, React, Docker, Flutter, Wireshark, TypeScript, and C#.",""]}
{"id":44, "data":["What skills does Alba Roma Gómez possess?", "Alba Roma Gómez has skills in Python, Aerodynamics, SOLIDWORKS, Simulink, C#, HTML, Java, React Native, React, Docker, Flutter, Wireshark, TypeScript, and C#.",""]}
{"id":45, "data":["Tell me about Alba Roma Gómez's high school education.", "Alba Roma Gómez completed her High School Diploma at Frances Kelsey Secondary School in British Columbia, Canada, during the 2017-2018 academic year, reaching the 11th grade.",""]}
{"id":46, "data":["What is Alba Roma Gómez's current role in aUPaEU?", "Alba Roma Gómez is a member of aUPaEU WP5, where she is currently developing the technological platform and artificial intelligent systems within it.",""]}